Ракович_В_Ю_70189466/src/InformationRegisters/КартаПрививок/КартаПрививок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КартаПрививок</name>
  <attributes>
    <name>ДатаВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияВакцины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реакция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоВведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.Вакцинация</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прививка</name>
    <type>
      <types>CatalogRef.Прививки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ракович_В_Ю_70189466/src/Enums/СтатусСтудента/СтатусСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусСтудента</name>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>АкадемическийОтпуск</name>
  </enumValues>
  <enumValues>
    <name>Отчислен</name>
  </enumValues>
  <enumValues>
    <name>Выпускник</name>
  </enumValues>
</mdclass:Enum>

Ракович_В_Ю_70189466/src/InformationRegisters/КартаПрививок/ManagerModule.bsl
// Проверить наличие прививки у студента
Функция ПроверитьНаличиеПрививки(Студент, Прививка) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ВЕРХ 1
    |    КартаПрививок.ДатаВакцинации
    |ИЗ
    |    РегистрСведений.КартаПрививок КАК КартаПрививок
    |ГДЕ
    |    КартаПрививок.Студент = &Студент
    |    И КартаПрививок.Прививка = &Прививка
    |УПОРЯДОЧИТЬ ПО
    |    КартаПрививок.ДатаВакцинации УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Прививка", Прививка);
    
    Возврат Не Запрос.Выполнить().Пустой();
    
КонецФункции

// Получить план прививок для группы
Функция ПолучитьПланПрививокДляГруппы(Группа, НаДату) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Наименование КАК Студент,
    |    Прививки.Наименование КАК ТребуемаяПрививка,
    |    Прививки.ВозрастНачала,
    |    Прививки.Периодичность
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Прививки КАК Прививки
    |        ПО Прививки.Обязательная = ИСТИНА
    |ГДЕ
    |    Студенты.Группа = &Группа
    |    И Студенты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусСтудента.Активный)
    |    И НЕ СУЩЕСТВУЕТ(
    |        ВЫБРАТЬ
    |            КартаПрививок.Ссылка
    |        ИЗ
    |            РегистрСведений.КартаПрививок КАК КартаПрививок
    |        ГДЕ
    |            КартаПрививок.Студент = Студенты.Ссылка
    |            И КартаПрививок.Прививка = Прививки.Ссылка
    |            И КартаПрививок.ДатаВакцинации >= &НаДату - Прививки.Периодичность
    |    )
    |
    |УПОРЯДОЧИТЬ ПО
    |    Студент,
    |    Прививки.ВозрастНачала";
    
    Запрос.УстановитьПараметр("Группа", Группа);
    Запрос.УстановитьПараметр("НаДату", НаДату);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции
